UK_Nightlife-project/UkNightlifeCA/test/getList/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ukn="http://j2ee.netbeans.org/wsdl/UkNightlife/src/ukNightlife">
  <soapenv:Body>
    <ukn:getList>
      <postCode>CR1 1TA</postCode>
      <searchRadius>10</searchRadius>
    </ukn:getList>
  </soapenv:Body>
</soapenv:Envelope>